soroborno = ['অ','আ','ই','ঈ','উ','ঊ','ঋ','ঌ','এ','ঐ','ও','ঔ']
banjonborno = ['ক','খ','গ','ঘ','ঙ','চ','ছ','জ','ঝ','ঞ','ট','ঠ','ড','ঢ','ণ','ত','থ','দ','ধ','ন','প','ফ','ব','ভ','ম','য','র','ল','শ','ষ','স','হ','ড়','ঢ়','য়']
Sorborno_kar = ['া','ি','ী','ু','ূ','ৃ','ৄ','ৢ','ৣ','ে','ৈ','ো','ৌ']
Soeborno_IPA = {'অ':'ɔ','আ':'ɐ','অ্যা':'æ','এ':'æ','ই':'i','ঈ':'i', 'উ':'u', 'ঊ':'u','এ':'e', 'ও':'o', 'অ':'o'}
Special_word_IPA = {'ঁ':'◌̃' , 'ঃ':'h', 'ঃ':'ɦ','ং':'ŋ'}
banjonborno_IPA = {'ক':'k','খ':'kʰ','গ':'ɡ','ঘ':'ɡʱ','ঢ়':'ɽʱ','ঞ':'ɲ','ব':'b','ভ':'β','দ':'d','ধ':'dʱ', 
                   'ড': 'ɖ', 'ঢ':'ɖʱ','জ':'z','য':'z','ঝ':'dʒʱ','হ':'ɦ','ক্ষ':'kʰ','ল':'l',
                   'ম':'m','ন':'n','ণ':'n','ঙ':'ŋ','প':'pɔ','ফ':'ɸ', 
                   'র':'r','ড়':'ɽ','স':'s','শ':'ʃ','ষ':'ʃ','স':'ʃ','ত':'t',
                   'ৎ':'t','থ':'tʰ','ট':'ʈ','ঠ':'ʈʰ','চ':'tʃ','ছ':'tʃʰ','য়':'j',
                   'ও': 'w','উ':'w', 'ণ': 'ɳ','য':'z','জ':'z'}
fola = []

# ক with soroborno..
banjonborno_with_soroborno = {}
for i in Sorborno_kar:
    banjonborno_with_soroborno['ক' + i] = 'hi'
for i in banjonborno:
    banjonborno_with_soroborno['ক' + i] = 'hi'
print(banjonborno_with_soroborno)
banjonborno_with_soroborno['কা'] = 'kɐ'
