soroborno = ['অ','আ','ই','ঈ','উ','ঊ','ঋ','ঌ','এ','ঐ','ও','ঔ']
banjonborno = ['ক','খ','গ','ঘ','ঙ','চ','ছ','জ','ঝ','ঞ','ট','ঠ','ড','ঢ','ণ','ত','থ','দ','ধ','ন','প','ফ','ব','ভ','ম','য','র','ল','শ','ষ','স','হ','ড়','ঢ়','য়']
Sorborno_kar = ['া','ি','ী','ু','ূ','ৃ','ে','ৈ','ো','ৌ']
soroborno_kar_IPA = {'া':'ɐ','ি':'ɪ','ী':'ɪ','ু':'u','ূ':'u','ৃ':'ɾɪ','ে':'e','ৈ':'oɪ̯','ো':'o','ৌ':'ou̯'}
Soeborno_IPA = {'অ':'ɔ','আ':'ɐ','অ্যা':'æ','এ':'æ','ই':'i','ঈ':'i', 'উ':'u', 'ঊ':'u','এ':'e', 'ও':'o', 'অ':'o','ঐ':'oɪ̯','ঋ':'ɾɪ'}
Special_word_IPA = {'ঁ':'◌̃' , 'ঃ':'h', 'ঃ':'ɦ','ং':'ŋ'}
banjonborno_IPA = {'ক':'k','খ':'kʰ','গ':'ɡ','ঘ':'ɡʱ','ঙ':'ŋ','চ':'tʃ','ছ':'tʃʰ','জ':'z','ঝ':'dʒʱ',
                   'ঞ':'ɲ','ট':'ʈ','ঠ':'ʈʰ','ড': 'ɖ', 'ঢ':'ɖʱ','ঢ়':'ɽʱ','ণ': 'ɳ','ত':'t','থ':'tʰ',
                   'দ':'d','ধ':'dʱ', 'ন':'n','প':'pɔ','ফ':'ɸ','ব':'bɔ','ভ':'β','ম':'m', 
                   'য':'z','র':'r','ল':'l','ড়':'ɽ','শ':'ʃ','ষ':'ʃ','স':'ʃ',
                   'ৎ':'t','য়':'j','হ':'ɦ','ক্ষ':'kʰ',
                   'ও': 'w','উ':'w','য়':'ʲe','জ':'z'}
hosonto = [2509]

get_ipaa = {
    #soroborno..
    'অ':'ɔ','আ':'ɐ','অ্যা':'æ','এ':'æ','ই':'i','ঈ':'i', 'উ':'u', 'ঊ':'u','এ':'e', 'ও':'o', 'অ':'o','ঐ':'oɪ̯','ঋ':'ɾɪ',
    #banjonborno..
    'ক':'k','খ':'kʰ','গ':'ɡ','ঘ':'ɡʱ','ঙ':'ŋ','চ':'tʃ','ছ':'tʃʰ','জ':'z','ঝ':'dʒʱ',
                   'ঞ':'ɲ','ট':'ʈ','ঠ':'ʈʰ','ড': 'ɖ', 'ঢ':'ɖʱ','ঢ়':'ɽʱ','ণ': 'ɳ','ত':'t','থ':'tʰ',
                   'দ':'d','ধ':'dʱ', 'ন':'n','প':'pɔ','ফ':'ɸ','ব':'bɔ','ভ':'β','ম':'m', 
                   'য':'z','র':'r','ল':'l','ড়':'ɽ','শ':'ʃ','ষ':'ʃ','স':'ʃ',
                   'ৎ':'t','য়':'j','হ':'ɦ','ক্ষ':'kʰ',
                   'ও': 'w','উ':'w','য়':'ʲe','জ':'z',
    #kar er jonno ipa
    'া':'ɐ','ি':'ɪ','ী':'ɪ','ু':'u','ূ':'u','ৃ':'ɾɪ','ে':'e','ৈ':'oɪ̯','ো':'o','ৌ':'ou̯',
    #special word ipa ,,, 'ঁ':'◌̃' 
    'ঁ':'' , 'ঃ':'h', 'ঃ':'ɦ','ং':'ŋ'
    

}