soroborno = ['অ','আ','ই','ঈ','উ','ঊ','ঋ','ঌ','এ','ঐ','ও','ঔ']
banjonborno = ['ক','খ','গ','ঘ','ঙ','চ','ছ','জ','ঝ','ঞ','ট','ঠ','ড','ঢ','ণ','ত','থ','দ','ধ','ন','প','ফ','ব','ভ','ম','য','র','ল','শ','ষ','স','হ','ড়','ঢ়','য়']
Sorborno_kar = ['া','ি','ী','ু','ূ','ৃ','ে','ৈ','ো','ৌ']
soroborno_kar_IPA = {'া':'ɐ','ি':'ɪ','ী':'ɪ','ু':'u','ূ':'u','ৃ':'ɾɪ','ে':'e','ৈ':'oɪ̯','ো':'o','ৌ':'ou̯'}
Soeborno_IPA = {'অ':'ɔ','আ':'ɐ','অ্যা':'æ','এ':'æ','ই':'i','ঈ':'i', 'উ':'u', 'ঊ':'u','এ':'e', 'ও':'o', 'অ':'o','ঐ':'oɪ̯','ঋ':'ɾɪ'}
Special_word_IPA = {'ঁ':'◌̃' , 'ঃ':'h', 'ঃ':'ɦ','ং':'ŋ'}
banjonborno_IPA = {'ক':'k','খ':'kʰ','গ':'ɡ','ঘ':'ɡʱ','ঙ':'ŋ','চ':'tʃ','ছ':'tʃʰ','জ':'z','ঝ':'dʒʱ',
                   'ঞ':'ɲ','ট':'ʈ','ঠ':'ʈʰ','ড': 'ɖ', 'ঢ':'ɖʱ','ঢ়':'ɽʱ','ণ': 'ɳ','ত':'t','থ':'tʰ',
                   'দ':'d','ধ':'dʱ', 'ন':'n','প':'pɔ','ফ':'ɸ','ব':'bɔ','ভ':'v','ম':'m', 
                   'য':'z','র':'r','ল':'l','ড়':'ɽ','শ':'ʃ','ষ':'ʃ','স':'ʃ',
                   'ৎ':'t','য়':'j','হ':'ɦ','ক্ষ':'kʰ',
                   'ও': 'w','উ':'w','য়':'ʲe','জ':'z'}
hosonto = [2509]
number = ['০' , '১' , '২' , '৩', '৪', '৫' , '৬', '৭' , '৮', '৯']
number_to_IPA = {'০':'shunnô' , '১':'æk' , '২':'dui' , '৩': 'tin', '৪':'char', '৫':'pãch' , '৬':'chhôy', '৭':'shat' , '৮':'aṭ', '৯':'nôy'}

number_to_word = {
    '.': 'দশমিক',
    '0': 'শূন্য',
    '1': 'এক','2': 'দুই','3': 'তিন','4': 'চার','5': 'পাঁচ','6': 'ছয়','7': 'সাত','8': 'আট','9': 'নয়',
    '10': 'দশ','11': 'এগারো','12': 'বার','13': 'তের','14': 'চৌদ্দ','15': 'পনের','16': 'ষোল','17': 'সতের','18': 'আঠার','19': 'উনিশ',
    '20': 'বিশ','21': 'একুশ','22': 'বাইশ','23': 'তেইশ','24': 'চব্বিশ','25': 'পঁচিশ','26': 'ছাব্বিশ','27': 'সাতাশ','28': 'আঠাশ','29': 'ঊনত্রিশ',
    '30': 'ত্রিশ','31': 'একত্রিশ','32': 'বত্রিশ','33': 'তেত্রিশ','34': 'চৌত্রিশ','35': 'পঁয়ত্রিশ','36': 'ছত্রিশ','37': 'সাঁইত্রিশ','38': 'আটত্রিশ','39': 'ঊনচল্লিশ',
    '40': 'চল্লিশ','41': 'একচল্লিশ','42': 'বিয়াল্লিশ','43': 'তেতাল্লিশ','44': 'চুয়াল্লিশ','45': 'পঁয়তাল্লিশ','46': 'ছেচল্লিশ','47': 'সাতচল্লিশ','48': 'আটচল্লিশ','49': 'ঊনপঞ্চাশ',
    '50': 'পঞ্চাশ','51': 'একান্ন','52': 'বায়ান্ন','53': 'তিপ্পান্ন','54': 'চুয়ান্ন','55': 'পঞ্চান্ন','56': 'ছাপ্পান্ন','57': 'সাতান্ন','58': 'আটান্ন','59': 'ঊনষাট',
    '60': 'ষাট','61': 'একষট্টি','62': 'বাষট্টি','63': 'তেষট্টি','64': 'চৌষট্টি','65': 'পঁয়ষট্টি','66': 'ছেষট্টি','67': 'সাতষট্টি','68': 'আটষট্টি','69': 'ঊনসত্তর',
    '70': 'সত্তর','71': 'একাত্তর','72': 'বাহাত্তর','73': 'তিয়াত্তর','74': 'চুয়াত্তর','75': 'পঁচাত্তর','76': 'ছিয়াত্তর','77': 'সাতাত্তর','78': 'আটাত্তর','79': 'ঊনআশি',
    '80': 'আশি','81': 'একাশি','82': 'বিরাশি','83': 'তিরাশি','84': 'চুরাশি','85': 'পঁচাশি','86': 'ছিয়াশি','87': 'সাতাশি','88': 'আটাশি','89': 'ঊননব্বই',
    '90': 'নব্বই','91': 'একানব্বই','92': 'বিরানব্বই','93': 'তিরানব্বই','94': 'চুরানব্বই','95': 'পঁচানব্বই','96': 'ছিয়ানব্বই','97': 'সাতানব্বই','98': 'আটানব্বই','99': 'নিরানব্বই','100': 'একশো',
}

number_to_word_units = {'quadtrilion':'পদ্ম','trilion':'চক্র','bilion':'ববর্বুদ','koti': 'কোটি','lokkho': 'লক্ষ','hazar': 'হাজার','sotok': 'শত','ekok': '',}
get_ipaa = {
    #soroborno..
    'অ':'ɔ','আ':'ɐ','অ্যা':'æ','এ':'æ','ই':'i','ঈ':'i', 'উ':'u', 'ঊ':'u','এ':'e', 'ও':'o','ঐ':'oɪ̯','ঋ':'ɾɪ',
    #banjonborno.. 'চ':'tʃ'
    'ক':'k','খ':'kʰ','গ':'ɡ','ঘ':'ɡʱ','ঙ':'ŋ','চ':'c','ছ':'tʃʰ','জ':'z','ঝ':'dʒʱ',
    'ঞ':'ɲ','ট':'ʈ','ঠ':'ʈʰ','ড': 'ɖ', 'ঢ':'ɖʱ','ঢ়':'ɽʱ','ণ': 'ɳ','ত':'t','থ':'tʰ',
    'দ':'d','ধ':'dʱ', 'ন':'n','প':'p','ফ':'ɸ','ব':'b','ভ':'v','ম':'m', 
    'য':'z','র':'r','ল':'l','ড়':'ɽ','শ':'ʃ','ষ':'ʃ','স':'ʃ',
    'ৎ':'t','য়':'e̯','হ':'ɦ','ক্ষ':'kʰ',
    'উ':'w','য়য়':'ʲ','জ':'z',
    #kar er jonno ipa
    'া':'ɐ','ি':'ɪ','ী':'ɪ','ু':'u','ূ':'u','ৃ':'ɾɪ','ে':'e','ৈ':'oɪ̯','ো':'o','ৌ':'ou̯',
    #special word ipa ,,, 'ঁ':'◌̃' 
    'ঁ':'' , 'ঃ':'h', 'ঃ':'ɦ','ং':'ŋ',
    #fola jukto borno...
    #'য়ে':'ʲe' , 'য়া':'ʲɐ'
    

}